{
"fubars": [
"foo", "bar", "baz", "qux", "quux", "garply", "waldo", "fred", "plugh",
"xyzzy", "thud", "parm11", "parm12", "parm13", "parm14", "parm15", "parm16",
"parm17", "parm18", "parm19", "parm20", "parm21", "parm22", "parm23", "parm24",
"parm25", "parm26", "parm27", "parm28", "parm29", "parm30", "parm31", "parm32",
"parm33", "parm34", "parm35", "parm36", "parm37", "parm38", "parm39", "parm40",
"parm41", "parm42", "parm43", "parm44", "parm45", "parm46", "parm47", "parm48",
"parm49", "parm50"
],
"nouns": [
  "account", "act", "adjustment", "advertisement", "agreement", "air", "amount",
  "amusement", "angle", "animal", "answer", "ant", "apparatus", "apple",
  "approval", "arch", "argument", "arm", "army", "art", "attack", "attempt",
  "attention", "attraction", "authority", "baby", "back", "bag", "balance",
  "ball", "band", "base", "basin", "basket", "bath", "bed", "bee", "behavior",
  "belief", "bell", "berry", "bird", "birth", "bit", "bite", "blade", "blood",
  "blow", "board", "boat", "body", "bone", "book", "boot", "bottle", "box",
  "boy", "brain", "brake", "branch", "brass", "bread", "breath", "brick",
  "bridge", "brother", "brush", "bucket", "building", "bulb", "burn", "burst",
  "business", "butter", "button", "cake", "camera", "canvas", "card", "care",
  "carriage", "cart", "cat", "cause", "chain", "chalk", "chance", "change",
  "cheese", "chess", "chin", "church", "circle", "clock", "cloth", "cloud",
  "coal", "coat", "collar", "color", "comb", "comfort", "committee", "company",
  "comparison", "competition", "condition", "connection", "control", "cook",
  "copper", "copy", "cord", "cork", "cough", "country", "cover", "cow", "crack",
  "credit", "crime", "crush", "cry", "cup", "current", "curtain", "curve",
  "cushion", "damage", "danger", "daughter", "day", "death", "debt", "decision",
  "degree", "design", "desire", "destruction", "detail", "development",
  "digestion", "direction", "discovery", "discussion", "disease", "disgust",
  "distance", "distribution", "division", "dog", "door", "doubt", "drain",
  "drawer", "dress", "drink", "driving", "drop", "dust", "ear", "earth", "edge",
  "education", "effect", "egg", "end", "engine", "error", "event", "example",
  "exchange", "existence", "expansion", "experience", "expert", "eye", "face",
  "fact", "fall", "family", "farm", "father", "fear", "feather", "feeling",
  "fiction", "field", "fight", "finger", "fire", "fish", "flag", "flame",
  "flight", "floor", "flower", "fly", "fold", "food", "foot", "force", "fork",
  "form", "fowl", "frame", "friend", "front", "fruit", "garden", "girl", "glass",
  "glove", "goat", "gold", "government", "grain", "grass", "grip", "group",
  "growth", "guide", "gun", "hair", "hammer", "hand", "harbor", "harmony", "hat",
  "hate", "head", "hearing", "heart", "heat", "help", "history", "hole", "hook",
  "hope", "horn", "horse", "hospital", "hour", "house", "humor", "ice", "idea",
  "impulse", "increase", "industry", "ink", "insect", "instrument", "insurance",
  "interest", "invention", "iron", "island", "jelly", "jewel", "join", "journey",
  "judge", "jump", "kettle", "key", "kick", "kiss", "knee", "knife", "knot",
  "knowledge", "land", "language", "laugh", "lead", "leaf", "learning",
  "leather", "leg", "letter", "level", "library", "lift", "light", "limit",
  "line", "linen", "lip", "liquid", "list", "lock", "look", "loss", "love",
  "low", "machine", "man", "manager", "map", "mark", "market", "mass", "match",
  "meal", "measure", "meat", "meeting", "memory", "metal", "middle", "milk",
  "mind", "mine", "minute", "mist", "money", "monkey", "month", "moon",
  "morning", "mother", "motion", "mountain", "mouth", "move", "muscle", "music",
  "nail", "name", "nation", "neck", "need", "needle", "nerve", "net", "news",
  "night", "noise", "nose", "note", "number", "nut", "observation", "offer",
  "office", "oil", "operation", "opinion", "orange", "order", "organization",
  "ornament", "oven", "owner", "page", "pain", "paint", "paper", "parcel",
  "part", "paste", "payment", "peace", "pen", "pencil", "person", "picture",
  "pig", "pin", "pipe", "place", "plane", "plant", "plate", "play", "pleasure",
  "plough", "pocket", "point", "poison", "polish", "porter", "position", "pot",
  "potato", "powder", "power", "price", "print", "prison", "process", "produce",
  "profit", "property", "prose", "protest", "pull", "pump", "punishment",
  "purpose", "push", "quality", "question", "rail", "rain", "range", "rat",
  "rate", "ray", "reaction", "reading", "reason", "receipt", "record", "regret",
  "relation", "religion", "representative", "request", "respect", "rest",
  "reward", "rhythm", "rice", "ring", "river", "road", "rod", "roll", "roof",
  "room", "root", "rub", "rule", "run", "sail", "salt", "sand", "scale",
  "school", "science", "scissors", "screw", "sea", "seat", "secretary", "seed",
  "selection", "self", "sense", "servant", "sex", "shade", "shake", "shame",
  "sheep", "shelf", "ship", "shirt", "shock", "shoe", "side", "sign", "silk",
  "silver", "sister", "size", "skin", "skirt", "sky", "sleep", "slip", "slope",
  "smash", "smell", "smile", "smoke", "snake", "sneeze", "snow", "soap",
  "society", "sock", "son", "song", "sort", "sound", "soup", "space", "spade",
  "sponge", "spoon", "spring", "square", "stage", "stamp", "star", "start",
  "statement", "station", "steam", "steel", "stem", "step", "stick", "stitch",
  "stocking", "stomach", "stone", "stop", "store", "story", "street", "stretch",
  "structure", "substance", "sugar", "suggestion", "summer", "sun", "support",
  "surprise", "swim", "system", "table", "tail", "talk", "taste", "tax",
  "teaching", "tendency", "test", "theory", "thing", "thought", "thread",
  "throat", "thumb", "thunder", "ticket", "time", "tin", "toe", "tongue",
  "tooth", "top", "touch", "town", "trade", "train", "transport", "tray", "tree",
  "trick", "trouble", "trousers", "turn", "twist", "umbrella", "unit", "use",
  "value", "verse", "vessel", "view", "voice", "walk", "wall", "war", "wash",
  "waste", "watch", "water", "wave", "wax", "way", "weather", "week", "weight",
  "wheel", "whip", "whistle", "wind", "window", "wine", "wing", "winter", "wire",
  "woman", "wood", "wool", "word", "work", "worm", "wound", "writing", "year"
],
"verbs": [
  "ask", "balance", "calculate", "do", "educate", "feel", "find", "get", "give",
  "go", "hack", "illuminate", "juggle", "know", "leave", "look", "make",
  "navigate", "optimize", "play", "query", "register", "say", "see", "seek",
  "take", "tell", "think", "try", "use", "validate", "want", "work", "xfer",
  "yank", "zip"
],
"adverbs": [
  "about", "above", "abroad", "absolutely", "across", "actually", "again", "ago",
  "ahead", "almost", "alone", "along", "already", "also", "altogether", "always",
  "any", "anyway", "anywhere", "apart", "around", "as", "aside", "automatically",
  "away", "back", "bad", "basically", "before", "behind", "below", "best",
  "better", "between", "both", "briefly", "bright", "by", "carefully",
  "certainly", "cheap", "clean", "clear", "clearly", "close", "closely",
  "collect", "completely", "constantly", "cool", "currently", "daily", "deeply",
  "definitely", "deliberately", "direct", "directly", "down", "downtown", "each",
  "early", "easily", "easy", "effectively", "else", "elsewhere", "enough",
  "equally", "especially", "essentially", "eventually", "ever", "everywhere",
  "exactly", "extra", "extremely", "fair", "fairly", "false", "far", "fast",
  "finally", "fine", "first", "flat", "forever", "forth", "forward", "free",
  "frequently", "fresh", "full", "fully", "generally", "gently", "greatly",
  "gross", "hard", "hardly", "here", "highly", "honest", "honestly", "hopefully",
  "how", "however", "ill", "immediately", "in", "initially", "instead", "item",
  "just", "last", "late", "later", "least", "left", "less", "likely",
  "literally", "little", "lot", "loud", "lower", "mainly", "maybe", "merely",
  "more", "moreover", "morning", "mostly", "much", "naturally", "near", "nearby",
  "nearly", "necessarily", "never", "new", "next", "no", "none", "normally",
  "not", "now", "nowhere", "obviously", "occasionally", "off", "often", "ok",
  "on", "once", "only", "originally", "otherwise", "out", "overall", "perfectly",
  "personally", "physically", "please", "possibly", "pray", "pretty",
  "previously", "primarily", "probably", "proper", "properly", "quick",
  "quickly", "quite", "rarely", "rather", "readily", "real", "really",
  "recently", "regularly", "relatively", "right", "roughly", "seriously",
  "short", "significantly", "similarly", "simply", "since", "slightly", "slow",
  "slowly", "small", "smooth", "so", "somehow", "sometimes", "somewhat",
  "somewhere", "soon", "specifically", "straight", "strange", "strongly",
  "successfully", "such", "suddenly", "super", "sure", "terribly", "the", "then",
  "there", "therefore", "thick", "thin", "though", "through", "thus", "tight",
  "to", "today", "together", "tomorrow", "tonight", "too", "totally", "tourist",
  "true", "truly", "twice", "ultimately", "under", "unfortunately", "up",
  "usually", "very", "virtually", "weekly", "well", "whatever", "when",
  "whenever", "where", "why", "wide", "widely", "wild", "within", "without",
  "wrong", "yeah", "yesterday", "yet"
],
"adjectives": [
  "adorable", "adventurous", "aggressive", "agreeable", "alert", "alive",
  "amused", "angry", "annoyed", "annoying", "anxious", "arrogant", "ashamed",
  "attractive", "average", "awful", "bad", "beautiful", "better", "bewildered",
  "black", "bloody", "blue", "blueEyed", "blushing", "bored", "brainy", "brave",
  "breakable", "bright", "busy", "calm", "careful", "cautious", "charming",
  "cheerful", "clean", "clear", "clever", "cloudy", "clumsy", "colorful",
  "combative", "comfortable", "concerned", "condemned", "confused",
  "cooperative", "courageous", "crazy", "creepy", "crowded", "cruel", "curious",
  "cute", "dangerous", "dark", "dead", "defeated", "defiant", "delightful",
  "depressed", "determined", "different", "difficult", "disgusted", "distinct",
  "disturbed", "dizzy", "doubtful", "drab", "dull", "eager", "easy", "elated",
  "elegant", "embarrassed", "enchanting", "encouraging", "energetic",
  "enthusiastic", "envious", "evil", "excited", "expensive", "exuberant", "fair",
  "faithful", "famous", "fancy", "fantastic", "fierce", "filthy", "fine",
  "foolish", "fragile", "frail", "frantic", "friendly", "frightened", "funny",
  "gentle", "gifted", "glamorous", "gleaming", "glorious", "good", "gorgeous",
  "graceful", "grieving", "grotesque", "grumpy", "handsome", "happy", "healthy",
  "helpful", "helpless", "hilarious", "homeless", "homely", "horrible", "hungry",
  "hurt", "ill", "important", "impossible", "inexpensive", "innocent",
  "inquisitive", "itchy", "jealous", "jittery", "jolly", "joyous", "kind",
  "lazy", "light", "lively", "lonely", "long", "lovely", "lucky", "magnificent",
  "misty", "modern", "motionless", "muddy", "mushy", "mysterious", "nasty",
  "naughty", "nervous", "nice", "nutty", "obedient", "obnoxious", "odd",
  "oldFashioned", "open", "outrageous", "outstanding", "panicky", "perfect",
  "plain", "pleasant", "poised", "poor", "powerful", "precious", "prickly",
  "proud", "putrid", "puzzled", "quaint", "real", "relieved", "repulsive",
  "rich", "scary", "selfish", "shiny", "shy", "silly", "sleepy", "smiling",
  "smoggy", "sore", "sparkling", "splendid", "spotless", "stormy", "strange",
  "stupid", "successful", "super", "talented", "tame", "tasty", "tender",
  "tense", "terrible", "thankful", "thoughtful", "thoughtless", "tired", "tough",
  "troubled", "ugliest", "ugly", "uninterested", "unsightly", "unusual", "upset",
  "uptight", "vast", "victorious", "vivacious", "wandering", "weary", "wicked",
  "wideEyed", "wild", "witty", "worried", "worrisome", "wrong", "zany",
  "zealous" 
]
}
