; ModuleID = 'test1_orange_rpc.mod.c'
source_filename = "test1_orange_rpc.mod.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._tag = type { i32, i32, i32 }
%struct._requesta_datatype = type { i32, %struct._trailer_datatype }
%struct._trailer_datatype = type { i32, i32, i32, i16, i16 }
%struct._responsea_datatype = type { double, %struct._trailer_datatype }
%struct._nextrpc_datatype = type { i32, i32, i32, %struct._trailer_datatype }
%struct._okay_datatype = type { i32, %struct._trailer_datatype }
%union.pthread_attr_t = type { i64, [48 x i8] }

@_handle_requesta.inited = internal global i32 0, align 4, !dbg !0
@_handle_requesta.psocket = internal global i8* null, align 8, !dbg !13
@_handle_requesta.ssocket = internal global i8* null, align 8, !dbg !15
@.str = private unnamed_addr constant [13 x i8] c"TAG_REQUESTA\00", section "llvm.metadata"
@.str.1 = private unnamed_addr constant [23 x i8] c"test1_orange_rpc.mod.c\00", section "llvm.metadata"
@.str.2 = private unnamed_addr constant [14 x i8] c"TAG_RESPONSEA\00", section "llvm.metadata"
@_handle_nxtrpc.inited = internal global i32 0, align 4, !dbg !17
@_handle_nxtrpc.psocket = internal global i8* null, align 8, !dbg !36
@_handle_nxtrpc.ssocket = internal global i8* null, align 8, !dbg !38
@.str.3 = private unnamed_addr constant [12 x i8] c"TAG_NEXTRPC\00", section "llvm.metadata"

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "inited", scope: !2, file: !3, line: 10, type: !35, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "_handle_requesta", scope: !3, file: !3, line: 9, type: !4, scopeLine: 9, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !8)
!3 = !DIFile(filename: "test1_orange_rpc.mod.c", directory: "/home/tchen/gaps/build/apps/tests/test1/partitioned/multithreaded/orange")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git d24d5c8e308e689dcd83cbafd2e8bd32aa845a15)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, retainedTypes: !9, globals: !12, splitDebugInlining: false, nameTableKind: None)
!8 = !{}
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !{!0, !13, !15, !17, !36, !38}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "psocket", scope: !2, file: !3, line: 11, type: !6, isLocal: true, isDefinition: true)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "ssocket", scope: !2, file: !3, line: 12, type: !6, isLocal: true, isDefinition: true)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "inited", scope: !19, file: !3, line: 46, type: !35, isLocal: true, isDefinition: true)
!19 = distinct !DISubprogram(name: "_handle_nxtrpc", scope: !3, file: !3, line: 45, type: !20, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !8)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "gaps_tag", file: !24, line: 29, baseType: !25)
!24 = !DIFile(filename: "../../../../../../src/hal/api/xdcomms.h", directory: "/home/tchen/gaps/build/apps/tests/test1/partitioned/multithreaded/orange")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tag", file: !24, line: 25, size: 96, elements: !26)
!26 = !{!27, !33, !34}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !25, file: !24, line: 26, baseType: !28, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !29, line: 26, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !31, line: 42, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !25, file: !24, line: 27, baseType: !28, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !25, file: !24, line: 28, baseType: !28, size: 32, offset: 64)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "psocket", scope: !19, file: !3, line: 47, type: !6, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "ssocket", scope: !19, file: !3, line: 48, type: !6, isLocal: true, isDefinition: true)
!40 = !{i32 7, !"Dwarf Version", i32 4}
!41 = !{i32 2, !"Debug Info Version", i32 3}
!42 = !{i32 1, !"wchar_size", i32 4}
!43 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git d24d5c8e308e689dcd83cbafd2e8bd32aa845a15)"}
!44 = !DILocalVariable(name: "tag", arg: 1, scope: !2, file: !3, line: 9, type: !6)
!45 = !DILocation(line: 9, column: 52, scope: !2)
!46 = !DILocalVariable(name: "t_tag", scope: !2, file: !3, line: 13, type: !23)
!47 = !DILocation(line: 13, column: 14, scope: !2)
!48 = !DILocalVariable(name: "o_tag", scope: !2, file: !3, line: 14, type: !23)
!49 = !DILocation(line: 14, column: 14, scope: !2)
!50 = !DILocalVariable(name: "reqA", scope: !2, file: !3, line: 17, type: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "requesta_datatype", file: !52, line: 57, baseType: !53)
!52 = !DIFile(filename: "../autogen/codec.h", directory: "/home/tchen/gaps/build/apps/tests/test1/partitioned/multithreaded/orange")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_requesta_datatype", file: !52, line: 54, size: 160, elements: !54)
!54 = !{!55, !59}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !53, file: !52, line: 55, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !57, line: 26, baseType: !58)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !31, line: 41, baseType: !35)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !53, file: !52, line: 56, baseType: !60, size: 128, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "trailer_datatype", file: !52, line: 23, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_trailer_datatype", file: !52, line: 17, size: 128, elements: !62)
!62 = !{!63, !64, !65, !66, !70}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !61, file: !52, line: 18, baseType: !28, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "rqr", scope: !61, file: !52, line: 19, baseType: !28, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !61, file: !52, line: 20, baseType: !28, size: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !61, file: !52, line: 21, baseType: !67, size: 16, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !29, line: 25, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !31, line: 40, baseType: !69)
!69 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !61, file: !52, line: 22, baseType: !67, size: 16, offset: 112)
!71 = !DILocation(line: 17, column: 24, scope: !2)
!72 = !DILocation(line: 17, column: 5, scope: !2)
!73 = !DILocalVariable(name: "resA", scope: !2, file: !3, line: 22, type: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "responsea_datatype", file: !52, line: 67, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_responsea_datatype", file: !52, line: 64, size: 192, elements: !76)
!76 = !{!77, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !75, file: !52, line: 65, baseType: !78, size: 64)
!78 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !75, file: !52, line: 66, baseType: !60, size: 128, offset: 64)
!80 = !DILocation(line: 22, column: 24, scope: !2)
!81 = !DILocation(line: 22, column: 5, scope: !2)
!82 = !DILocation(line: 26, column: 5, scope: !2)
!83 = !DILocation(line: 27, column: 10, scope: !84)
!84 = distinct !DILexicalBlock(scope: !2, file: !3, line: 27, column: 9)
!85 = !DILocation(line: 27, column: 9, scope: !2)
!86 = !DILocation(line: 28, column: 14, scope: !87)
!87 = distinct !DILexicalBlock(scope: !84, file: !3, line: 27, column: 18)
!88 = !DILocation(line: 29, column: 17, scope: !87)
!89 = !DILocation(line: 29, column: 15, scope: !87)
!90 = !DILocation(line: 30, column: 17, scope: !87)
!91 = !DILocation(line: 30, column: 15, scope: !87)
!92 = !DILocation(line: 31, column: 7, scope: !87)
!93 = !DILocation(line: 32, column: 5, scope: !87)
!94 = !DILocation(line: 34, column: 23, scope: !2)
!95 = !DILocation(line: 34, column: 32, scope: !2)
!96 = !DILocation(line: 34, column: 5, scope: !2)
!97 = !DILocation(line: 35, column: 14, scope: !2)
!98 = !DILocation(line: 35, column: 10, scope: !2)
!99 = !DILocation(line: 35, column: 12, scope: !2)
!100 = !DILocation(line: 41, column: 5, scope: !2)
!101 = !DILocation(line: 42, column: 19, scope: !2)
!102 = !DILocation(line: 42, column: 28, scope: !2)
!103 = !DILocation(line: 42, column: 5, scope: !2)
!104 = !DILocation(line: 43, column: 1, scope: !2)
!105 = !DILocalVariable(name: "n_tag", arg: 1, scope: !19, file: !3, line: 45, type: !22)
!106 = !DILocation(line: 45, column: 31, scope: !19)
!107 = !DILocalVariable(name: "t_tag", scope: !19, file: !3, line: 49, type: !23)
!108 = !DILocation(line: 49, column: 14, scope: !19)
!109 = !DILocalVariable(name: "o_tag", scope: !19, file: !3, line: 50, type: !23)
!110 = !DILocation(line: 50, column: 14, scope: !19)
!111 = !DILocalVariable(name: "nxt", scope: !19, file: !3, line: 53, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "nextrpc_datatype", file: !52, line: 35, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nextrpc_datatype", file: !52, line: 30, size: 224, elements: !114)
!114 = !{!115, !116, !117, !118}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !113, file: !52, line: 31, baseType: !56, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !113, file: !52, line: 32, baseType: !56, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !113, file: !52, line: 33, baseType: !56, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !113, file: !52, line: 34, baseType: !60, size: 128, offset: 96)
!119 = !DILocation(line: 53, column: 22, scope: !19)
!120 = !DILocation(line: 53, column: 5, scope: !19)
!121 = !DILocalVariable(name: "okay", scope: !19, file: !3, line: 58, type: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "okay_datatype", file: !52, line: 47, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_okay_datatype", file: !52, line: 44, size: 160, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !123, file: !52, line: 45, baseType: !56, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !123, file: !52, line: 46, baseType: !60, size: 128, offset: 32)
!127 = !DILocation(line: 58, column: 19, scope: !19)
!128 = !DILocation(line: 58, column: 5, scope: !19)
!129 = !DILocation(line: 62, column: 5, scope: !19)
!130 = !DILocation(line: 63, column: 10, scope: !131)
!131 = distinct !DILexicalBlock(scope: !19, file: !3, line: 63, column: 9)
!132 = !DILocation(line: 63, column: 9, scope: !19)
!133 = !DILocation(line: 64, column: 14, scope: !134)
!134 = distinct !DILexicalBlock(scope: !131, file: !3, line: 63, column: 18)
!135 = !DILocation(line: 65, column: 17, scope: !134)
!136 = !DILocation(line: 65, column: 15, scope: !134)
!137 = !DILocation(line: 66, column: 17, scope: !134)
!138 = !DILocation(line: 66, column: 15, scope: !134)
!139 = !DILocation(line: 67, column: 7, scope: !134)
!140 = !DILocation(line: 68, column: 5, scope: !134)
!141 = !DILocation(line: 70, column: 23, scope: !19)
!142 = !DILocation(line: 70, column: 32, scope: !19)
!143 = !DILocation(line: 70, column: 5, scope: !19)
!144 = !DILocation(line: 73, column: 5, scope: !19)
!145 = !DILocation(line: 74, column: 10, scope: !19)
!146 = !DILocation(line: 74, column: 12, scope: !19)
!147 = !DILocation(line: 75, column: 19, scope: !19)
!148 = !DILocation(line: 75, column: 28, scope: !19)
!149 = !DILocation(line: 75, column: 5, scope: !19)
!150 = !DILocation(line: 77, column: 22, scope: !19)
!151 = !DILocation(line: 77, column: 5, scope: !19)
!152 = !DILocation(line: 77, column: 12, scope: !19)
!153 = !DILocation(line: 77, column: 16, scope: !19)
!154 = !DILocation(line: 78, column: 22, scope: !19)
!155 = !DILocation(line: 78, column: 5, scope: !19)
!156 = !DILocation(line: 78, column: 12, scope: !19)
!157 = !DILocation(line: 78, column: 16, scope: !19)
!158 = !DILocation(line: 79, column: 22, scope: !19)
!159 = !DILocation(line: 79, column: 5, scope: !19)
!160 = !DILocation(line: 79, column: 12, scope: !19)
!161 = !DILocation(line: 79, column: 16, scope: !19)
!162 = !DILocation(line: 80, column: 1, scope: !19)
!163 = distinct !DISubprogram(name: "_hal_init", scope: !3, file: !3, line: 82, type: !164, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !8)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !10, !10}
!166 = !DILocalVariable(name: "inuri", arg: 1, scope: !163, file: !3, line: 82, type: !10)
!167 = !DILocation(line: 82, column: 22, scope: !163)
!168 = !DILocalVariable(name: "outuri", arg: 2, scope: !163, file: !3, line: 82, type: !10)
!169 = !DILocation(line: 82, column: 35, scope: !163)
!170 = !DILocation(line: 84, column: 14, scope: !163)
!171 = !DILocation(line: 84, column: 3, scope: !163)
!172 = !DILocation(line: 85, column: 15, scope: !163)
!173 = !DILocation(line: 85, column: 3, scope: !163)
!174 = !DILocation(line: 86, column: 3, scope: !163)
!175 = !DILocation(line: 87, column: 3, scope: !163)
!176 = !DILocation(line: 88, column: 3, scope: !163)
!177 = !DILocation(line: 89, column: 3, scope: !163)
!178 = !DILocation(line: 90, column: 1, scope: !163)
!179 = distinct !DISubprogram(name: "_wrapper_nxtrpc", scope: !3, file: !3, line: 93, type: !180, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !8)
!180 = !DISubroutineType(types: !181)
!181 = !{!6, !6}
!182 = !DILocalVariable(name: "tag", arg: 1, scope: !179, file: !3, line: 93, type: !6)
!183 = !DILocation(line: 93, column: 1, scope: !179)
!184 = !DILocation(line: 93, column: 1, scope: !185)
!185 = distinct !DILexicalBlock(scope: !179, file: !3, line: 93, column: 1)
!186 = distinct !{!186, !183, !183}
!187 = distinct !DISubprogram(name: "_wrapper_requesta", scope: !3, file: !3, line: 94, type: !180, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !8)
!188 = !DILocalVariable(name: "tag", arg: 1, scope: !187, file: !3, line: 94, type: !6)
!189 = !DILocation(line: 94, column: 1, scope: !187)
